app/Services/AuthService.php

    public function handleRegister($request)
    {
        return User::firstOrCreate([
            'name' => $request['name'],
            'email' => $request['email'],
            'password' => Hash::make($request['password']),
            'role_id' => UserRoles::EMPLOYEE->value,
            'user_details_id' => $request['user_details_id'] ?? null
        ]);
---
insert into `users` (`name`, `email`, `password`, `role_id`, `user_details_id`, `updated_at`, `created_at`) values ('user', 'testuser21@test.com', '$2y$12$nDqLlt7AikXy0.AUy6EfruYtTyl4CrTS6/z/vsMmGuwi5JxkXb0x2', 4, null, '2025-03-25 11:15:40', '2025-03-25 11:15:40')
select * from `users` where (`name` = 'user' and `email` = 'testuser21@test.com' and `password` = '$2y$12$nDqLlt7AikXy0.AUy6EfruYtTyl4CrTS6/z/vsMmGuwi5JxkXb0x2' and `role_id` = 4 and `user_details_id` is null) limit 1

    public function loginUser($request)
    {
        if (!Auth::attempt($request->safe()->only('email', 'password'), $request->boolean('remember'))) {
            return response()->json([
                'message' => 'Invalid login details'
            ], 401);
        }

        $user = User::where('email', $request->email)->firstOrFail();
---
select * from `users` where `email` = 'testuser1@test.com' limit 1

    private function registerRoles() : void
    {
        $existingRoles = ModelsRole::pluck('role_name')->toArray();
        $allRoles = array_map( fn($role) => $role->label(), UserRoles::cases());

        if (count(array_diff($allRoles, $existingRoles))) {
            foreach (UserRoles::cases() as $role) {
                ModelsRole::firstOrCreate(['role_name' => $role->label()]);
---
select `role_name` from `roles`
insert into `roles` (`role_name`, `updated_at`, `created_at`) values ('admin', '2025-03-25 11:08:16', '2025-03-25 11:08:16')
select * from `roles` where (`role_name` = 'admin') limit 1