app/Services/ProductService.php

    public function requestUpdateProduct(ProductRequest $request, Product $product)
    {
        try {
            return DB::transaction(function () use ($request, $product) {
                $updatedProducts = $this->updateProduct($request, $product);
---
update `products` set `product_name` = 'Wrap Dress', `product_type_id` = 2, `products`.`updated_at` = '2025-03-25 02:19:19' where `id` = 1