app/Services/ProductService.php

insert into `products` (`product_name`, `original_price`, `description`, `supplier_id`, `product_type_id`, `updated_at`, `created_at`) values ('test', '1000', 'lorem ipsum', 3, 2, '2025-03-24 15:22:12', '2025-03-24 15:22:12')
---
    public function requestCreateProduct(ProductRequest $request)
    {
        try {
            return DB::transaction(function () use ($request) {
                $products = $this->createProduct($request);

select * from `suppliers` where (`supplier_name` = 'lorem ipsum' and `company_name` = 'lorem ipsum') limit 1
---
    private function updateProduct(ProductRequest $request, Product $product): array
    {
        $validated = $request->safe();

        // Update supplier (unchanged)
        $supplier = $this->updateOrKeepSupplier($product->supplier, $validated->only(['supplier_name', 'company_name', 'address', 'contact']));

        // Handle product types
        $typeData = array_merge($validated->only(['type', 'subtype']), ['product_id' => $product]);
        if ($this->typeDataChanged($product, $typeData)) {
            $productTypes = $this->updateOrKeepProductTypes($product, $typeData);

            // Refresh the relationship
            $product->load('productType');

select * from `product_types` where `product_types`.`product_id` = 1 and `product_types`.`product_id` is not null limit 1
---
    private function updateOrKeepProductTypes(Product $product, array $typeData): array
    {
        $mainType = Type::firstOrCreate(['type_name' => $typeData['type']]);

        $subtypes = is_array($typeData['subtype']) ? $typeData['subtype'] : [$typeData['subtype']];

        // Get existing product types for this product
        $existingTypes = $product->productTypes->with(['type', 'subtype'])->get();