app/Http/Controllers/Api/ApiBaseController.php

insert into `products` (`product_name`, `original_price`, `description`, `supplier_id`, `product_type_id`, `updated_at`, `created_at`) values ('test', '1000', 'lorem ipsum', 6, 4, '2025-03-24 14:17:00', '2025-03-24 14:17:00')
select * from `products` where (`product_name` = 'test' and `original_price` = '1000' and `description` = 'lorem ipsum' and `supplier_id` = 6 and `product_type_id` = 4) limit 1
---
    protected function storeProduct($productData, $offsetData)
    {
        return Product::firstOrCreate([
            'product_name' => $productData['product_name'],
            'original_price' => $productData['original_price'],
            'description' => $productData['description'],
            'supplier_id' => $offsetData['supplier']['id'],
            'product_type_id' => $offsetData['productType']['id'],
        ]);

insert into `suppliers` (`supplier_name`, `company_name`, `address`, `contact`, `updated_at`, `created_at`) values ('lorem ipsum', 'lorem ipsum', 'lorem ipsum', '9874266312', '2025-03-24 14:14:07', '2025-03-24 14:14:07')
---
    protected function storeSupplier($supplierData)
    {
        return Supplier::create([
            'supplier_name' => $supplierData['supplier_name'],
            'company_name' => $supplierData['company_name'],
            'address' => $supplierData['address'],
            'contact' => $supplierData['contact']
        ]);

insert into `types` (`type_name`, `updated_at`, `created_at`) values ('test', '2025-03-24 14:14:07', '2025-03-24 14:14:07')
select * from `types` where (`type_name` = 'test') limit 1
insert into `subtypes` (`subtype_name`, `updated_at`, `created_at`) values ('test', '2025-03-24 14:14:07', '2025-03-24 14:14:07')
select * from `subtypes` where (`subtype_name` = 'test') limit 1
---
    protected function storeTypes($typeData)
    {
        $mainType = Type::firstOrCreate([
            'type_name' => $typeData['type']
        ]);

        $subType = Subtype::firstOrCreate([
            'subtype_name' => $typeData['subtype']
        ]);

insert into `product_types` (`type_id`, `subtype_id`, `updated_at`, `created_at`) values (1, 1, '2025-03-24 14:14:07', '2025-03-24 14:14:07')
---
    protected function storeProductType($typeID)
    {
        $productType = ProductType::create([
            'type_id' => $typeID['main'],
            'subtype_id' => $typeID['sub']
        ]);